load-tests/boe.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: "BOE Operations Load"

scenarios:
  - name: "Query BOEs"
    flow:
      - get:
          url: "/api/boe"
  - name: "Create BOE"
    flow:
      - post:
          url: "/api/boe"
          json:
            boeNumber: "BOE-TEST-123"
            amount: 5000